# Фильтрация строк в массиве по длине

Программа на C#, которая фильтрует массив строк так, чтобы в результирующем массиве остались только те строки, длина которых меньше или равна 3 символам.

## **Условия задачи**

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на __GitHub__
2. Нарисовать блок-схему алгоритма _(можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)_
3. Снабдить репозиторий оформленным текстовым описанием решения _(файл __README.md__)_
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом _(не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)_

**Задача:**

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Примеры:**
```
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []
```
***

## Как использовать

1. Запустите программу.
2. Введите строки через точку с запятой, когда программа запросит ввод.
3. Программа выведет отфильтрованный массив строк на экран.

## Реализация в коде

```csharp
using System;

class Program
{
    static void Main()
    {
        Console.Write("Введите строки через точку с запятой: ");
        string[] inputStrings = Console.ReadLine().Split();

        string[] resultStrings = FilterShortStrings(inputStrings);

        Console.WriteLine("Результат:");
        foreach (string s in resultStrings)
        {
            Console.WriteLine(s);
        }
    }

    static string[] FilterShortStrings(string[] strings)
    {
        // Максимальная длина строки
        int maxLength = 3;

        int count = 0;

        // Подсчитаем количество строк, удовлетворяющих условию
        for (int i = 0; i < strings.Length; i++)
        {
            if (strings[i].Length <= maxLength)
            {
                count++;
            }
        }

        // Создаем новый массив нужной длины
        string[] result = new string[count];

        // Заполняем новый массив подходящими строками
        int index = 0;
        for (int i = 0; i < strings.Length; i++)
        {
            if (strings[i].Length <= maxLength)
            {
                result[index] = strings[i];
                index++;
            }
        }

        return result;
    }
}
```